
var y= null;
var x = undefined;


var z = 5;
var w = 5.2;
var bool = true && false; /*можно производить логические действия*/

true && true /* верно и то и то*/
true || false /* одно из значений равно */
!true
== /* равно */
!=  /* не равно*/

var xx = "test";
var xx1 = 'test';  /* строка - текст */
"tsest23" + "test"

var arr =[1,2,3,4,5,6,8,12];
arr[0] /* получить элемент массива, начинается с нуля*/

arr.length   /* добавляет/убирает элемент массива именно кол-во*/
app.push - добовляет в конец массива /* есть другие значения для добавление/удаления в конец, в начало, так же забирать значения*/


var obj = {
    "red": wewe,
    "red2": 3
};
